In [2]:
import pandas as pd
from sqlalchemy import create_engine

# connection string
engine = create_engine(
    "postgresql+psycopg2://udemy:udemy123@localhost:5434/udemy_master_of_pandas"
)

# read table
employees = pd.read_sql("SELECT * FROM master.employees;", engine)

In [3]:
employees

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,None
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,None,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [4]:
employees['First Name']

0      Douglas
1       Thomas
2        Maria
3        Jerry
4        Larry
        ...
995      Henry
996    Phillip
997    Russell
998      Larry
999     Albert
Name: First Name, Length: 1000, dtype: object

In [5]:
type(employees['First Name'])

pandas.core.series.Series

In [6]:
employees[['First Name']]

    First Name
0      Douglas
1       Thomas
2        Maria
3        Jerry
4        Larry
..         ...
995      Henry
996    Phillip
997    Russell
998      Larry
999     Albert

[1000 rows x 1 columns]

In [8]:
type(employees[['First Name']])

pandas.core.frame.DataFrame

In [11]:
employees[['First Name' , 'Gender' , 'Salary']]

    First Name  Gender  Salary
0      Douglas    Male   97308
1       Thomas    Male   61933
2        Maria  Female  130590
3        Jerry    Male  138705
4        Larry    Male  101004
..         ...     ...     ...
995      Henry    None  132483
996    Phillip    Male   42392
997    Russell    Male   96914
998      Larry    Male   60500
999     Albert    Male  129949

[1000 rows x 3 columns]

In [12]:
employees[['First Name' , 'Gender' , 'Salary'][0]]

0      Douglas
1       Thomas
2        Maria
3        Jerry
4        Larry
        ...
995      Henry
996    Phillip
997    Russell
998      Larry
999     Albert
Name: First Name, Length: 1000, dtype: object

In [14]:
employees[['First Name' , 'Gender' , 'Salary'][0 : 2]]

    First Name  Gender
0      Douglas    Male
1       Thomas    Male
2        Maria  Female
3        Jerry    Male
4        Larry    Male
..         ...     ...
995      Henry    None
996    Phillip    Male
997    Russell    Male
998      Larry    Male
999     Albert    Male

[1000 rows x 2 columns]

In [16]:
employees.get('First Name')

0      Douglas
1       Thomas
2        Maria
3        Jerry
4        Larry
        ...
995      Henry
996    Phillip
997    Russell
998      Larry
999     Albert
Name: First Name, Length: 1000, dtype: object

In [18]:
employees.get(['First Name' , 'Gender' , 'Bonus %'])

    First Name  Gender  Bonus %
0      Douglas    Male    6.945
1       Thomas    Male    4.170
2        Maria  Female   11.858
3        Jerry    Male    9.340
4        Larry    Male    1.389
..         ...     ...      ...
995      Henry    None   16.655
996    Phillip    Male   19.675
997    Russell    Male    1.421
998      Larry    Male   11.985
999     Albert    Male   10.169

[1000 rows x 3 columns]

In [19]:
employees.loc[0]

First Name             Douglas
Gender                    Male
Start Date            8/6/1993
Last Login Time       12:42 PM
Salary                   97308
Bonus %                  6.945
Senior Management         True
Team                 Marketing
Name: 0, dtype: object

In [20]:
employees.loc[[2,5,19]]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
5,Dennis,Male,4/18/1987,1:35 AM,115163,10.125,False,Legal
19,Donna,Female,7/22/2010,3:48 AM,81014,1.894,False,Product

In [21]:
employees.loc[[10,2,5]]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
10,Louise,Female,8/12/1980,9:01 AM,63241,15.132,True,None
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
5,Dennis,Male,4/18/1987,1:35 AM,115163,10.125,False,Legal

In [22]:
employees.loc[[10,2,5] , ['First Name' , 'Salary']]

   First Name  Salary
10     Louise   63241
2       Maria  130590
5      Dennis  115163

In [23]:
employees.loc[990:]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
990,Robin,Female,7/24/1987,1:35 PM,100765,10.982,True,Client Services
991,Rose,Female,8/25/2002,5:12 AM,134505,11.051,True,Marketing
992,Anthony,Male,10/16/2011,8:35 AM,112769,11.625,True,Finance
993,Tina,Female,5/15/1997,3:53 PM,56450,19.040,True,Engineering
994,George,Male,6/21/2013,5:47 PM,98874,4.479,True,Marketing
995,Henry,None,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [25]:
employees.loc[990: , 'First Name':'Salary']

    First Name  Gender  Start Date Last Login Time  Salary
990      Robin  Female   7/24/1987         1:35 PM  100765
991       Rose  Female   8/25/2002         5:12 AM  134505
992    Anthony    Male  10/16/2011         8:35 AM  112769
993       Tina  Female   5/15/1997         3:53 PM   56450
994     George    Male   6/21/2013         5:47 PM   98874
995      Henry    None  11/23/2014         6:09 AM  132483
996    Phillip    Male   1/31/1984         6:30 AM   42392
997    Russell    Male   5/20/2013        12:39 PM   96914
998      Larry    Male   4/20/2013         4:45 PM   60500
999     Albert    Male   5/15/2012         6:24 PM  129949

In [26]:
employees.loc[:,'Gender':'Salary']

     Gender  Start Date Last Login Time  Salary
0      Male    8/6/1993        12:42 PM   97308
1      Male   3/31/1996         6:53 AM   61933
2    Female   4/23/1993        11:17 AM  130590
3      Male    3/4/2005         1:00 PM  138705
4      Male   1/24/1998         4:47 PM  101004
..      ...         ...             ...     ...
995    None  11/23/2014         6:09 AM  132483
996    Male   1/31/1984         6:30 AM   42392
997    Male   5/20/2013        12:39 PM   96914
998    Male   4/20/2013         4:45 PM   60500
999    Male   5/15/2012         6:24 PM  129949

[1000 rows x 4 columns]

In [28]:
employees.loc[:,'Gender':]

,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Male,3/31/1996,6:53 AM,61933,4.170,True,None
2,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...
995,None,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [29]:
employees.set_index(['First Name'] , inplace=True)

In [30]:
employees.loc['Thomas']

,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
First Name,,,,,,,
Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,None
Thomas,Male,6/4/1995,2:24 PM,62096,17.029,False,Marketing
Thomas,Male,4/6/2011,1:04 PM,103235,9.554,True,Human Resources
Thomas,None,8/31/1995,8:31 PM,41549,3.950,False,Sales
Thomas,Male,9/7/1991,9:51 AM,65251,11.211,False,Distribution
Thomas,Male,5/3/1990,9:29 AM,111371,15.081,True,Engineering
Thomas,Male,3/12/2016,3:10 PM,105681,19.572,False,Engineering

In [31]:
employees.loc[['Douglas' , 'Thomas'] , 'Gender']

First Name
Douglas    Male
Douglas    Male
Douglas    Male
Douglas    None
Douglas    Male
Thomas     Male
Thomas     Male
Thomas     Male
Thomas     None
Thomas     Male
Thomas     Male
Thomas     Male
Name: Gender, dtype: object

In [33]:
employees.loc[['Douglas' , 'Thomas'] , ['Gender' , 'Salary']]

           Gender  Salary
First Name
Douglas      Male   97308
Douglas      Male   83341
Douglas      Male   41428
Douglas      None  104496
Douglas      Male  132175
Thomas       Male   61933
Thomas       Male   62096
Thomas       Male  103235
Thomas       None   41549
Thomas       Male   65251
Thomas       Male  111371
Thomas       Male  105681

In [34]:
employees.loc[['Douglas' , 'Thomas'] , 'Gender' : 'Salary']

           Gender Start Date Last Login Time  Salary
First Name
Douglas      Male   8/6/1993        12:42 PM   97308
Douglas      Male   9/3/1999         4:00 PM   83341
Douglas      Male   1/8/2002         6:42 PM   41428
Douglas      None   2/4/2009         2:03 AM  104496
Douglas      Male   8/4/2007         5:23 AM  132175
Thomas       Male  3/31/1996         6:53 AM   61933
Thomas       Male   6/4/1995         2:24 PM   62096
Thomas       Male   4/6/2011         1:04 PM  103235
Thomas       None  8/31/1995         8:31 PM   41549
Thomas       Male   9/7/1991         9:51 AM   65251
Thomas       Male   5/3/1990         9:29 AM  111371
Thomas       Male  3/12/2016         3:10 PM  105681